contrib-other/camelse/examples/jbi2pojo/JBI2POJOCamelCompositeApp/test/TestCase1/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <jbi2:AnyMessage xmlns:jbi2="http://openesb.org/jbi2camel/message/JBI2POJOCamelJBIModule" xmlns:msgns="http://openesb.org/jbi2camel/JBI2POJOCamelJBIModule">Hello JBI </jbi2:AnyMessage>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
